import {SideBarModel} from "../../../../model/sideBarModel";


export const comments: SideBarModel[] = [
  {
    id: 1,
    text: "Институт",
    flag: true,
    router_link: "Институт",
    comments: [
      {
        id: 2,
        text: "Руководство института",
        router_link: "Руководство института",
        flag: true,
      }, {
        id: 3,
        text: "Образование",
        flag: true,
        router_link: "Образование",
      }, {
        id: 4,
        text: "Наука",
        flag: true,
        router_link: "Наука",
      }
    ]
  },
  {
    text: "Кафедра «Естественнонаучные и творческие дисциплины»",
    id: 5,
    flag: true,
    router_link: "Кафедра «Естественнонаучные и творческие дисциплины»",
    comments: [
      {
        id: 6,
        text: "Cостав кафедры",
        flag: true,
        router_link: "Cостав кафедры",
      },
      {
        id: 7,
        text: "Обучение",
        router_link: "Обучение",
        flag: true,
      }
      ,
      {
        id: 8,
        text: "Научная деятельность",
        router_link: "Научная деятельность",
        flag: true,
      }
      ,
      {
        id: 9,
        router_link: "План заседаний кафедры и подготовки учебно-методической литературы",
        text: "План заседаний кафедры и подготовки учебно-методической литературы",
        flag: true,
      }
    ]
  }
  ,
  {
    text: "Подраздиления",
    id: 10,
    router_link: "Подраздиления",
    flag: true,
    comments: [
      {
        id: 11,
        router_link: "Региональный центр тестирования и профессиональной ориентации учащейся молодежи",
        text: "Региональный центр тестирования и профессиональной ориентации учащейся молодежи",
        flag: true
      },
      {
        id: 12,
        router_link: "Подготовительное отделение",
        text: "Подготовительное отделение",
        flag: true
      }
    ]
  }
  ,
  {
    text: "Лицей",
    id: 13,
    router_link: "Лицей",
    flag: true
  }
  ,
  {
    text: "Школа юных архитекторов и дизайнеров",
    id: 14,
    router_link: "Школа юных архитекторов и дизайнеров",
    flag: true,
  },
  {
    text: "Онлайн-консультации",
    router_link: "Онлайн-консультации",
    id: 15,
    flag: true,
    comments: [
      {
        id: 16,
        router_link: "Расписание онлайн-консультаций",
        text: "Расписание онлайн-консультаций",
        flag: true,
      },
      {
        id: 17,
        router_link: "Онлайн-консультации для студентов",
        text: "Онлайн-консультации для студентов",
        flag: true,
      }
    ]
  }
  ,
  {
    router_link: "Политехническая школа юных",
    text: "Политехническая школа юных",
    id: 18,
    flag: true
  }
  ,
  {
    text: "Подготовка к ЦТ и Поступлению в ВУЗ",
    id: 19,
    flag: true,
    router_link: "Подготовка к ЦТ и Поступлению в ВУЗ",

    comments: [
      {
        id: 20,
        router_link: "Подготовительные курсы",
        text: "Подготовительные курсы",
        flag: true
      },
      {
        id: 21,
        router_link: "Выездные подготовительные курсы",
        text: "Выездные подготовительные курсы",
        flag: true
      },
      {
        id: 22,
        router_link: "Подготовительное отделение",
        text: "Подготовительное отделение",
        flag: true
      },
      {
        id: 23,
        text: "Профориентационная диагностика в БНТУ",
        flag: true,
        router_link: "Профориентационная диагностика в БНТУ",

      },
      {
        id: 24,
        router_link: "Дистанционная подготовка к ЦТ по математике",
        text: "Дистанционная подготовка к ЦТ по математике",
        flag: true
      }
    ]
  }
  ,
  {
    text: "Профориентационные субботы БНТУ",
    id: 25,
    router_link: "Профориентационные субботы БНТУ",
    flag: true,
  },
  {
    text: "Регистрация на репетиционное тестирование",
    id: 26,
    router_link: "Регистрация на репетиционное тестирование",
    flag: true,
  }
];
